third_party/cfd_suite/Docker/ESP/baseCase/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\n| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.3.0                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 1;

vertices (
    (-0.01 -0.01 -4.51)
    (14.01 -0.01 -4.51)
    (14.01 3.01 -4.51)
    (-0.01 3.01 -4.51)
    (-0.01 -0.01 5.51)
    (14.01 -0.01 5.51)
    (14.01 3.01 5.51)
    (-0.01 3.01 5.51)
);
blocks (hex (0 1 2 3 4 5 6 7) (8 2 6) simpleGrading (1 1 1));
edges ();
boundary (
    allBoundary {
        type patch;
        faces (
);});
