third_party/cfd_suite/Docker/ESP/baseCase/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Which of the steps to run
castellatedMesh true;
snap            true;
addLayers       false;


geometry
{
    wall.stl
    {
        type triSurfaceMesh;
        wall{
            name wall;
        }
    }
    LBo10.stl
    {
        type triSurfaceMesh;
        LBo10{
            name LBo10;
        }
    }
    symPlane.stl
    {
        type triSurfaceMesh;
        symPlane{
            name symPlane;
        }
    }
    Y0Z09.stl
    {
        type triSurfaceMesh;
        Y0Z09{
            name Y0Z09;
        }
    }
    Y0Z07.stl
    {
        type triSurfaceMesh;
        Y0Z07{
            name Y0Z07;
        }
    }
    Y0Z13.stl
    {
        type triSurfaceMesh;
        Y0Z13{
            name Y0Z13;
        }
    }
    Y0Z15.stl
    {
        type triSurfaceMesh;
        Y0Z15{
            name Y0Z15;
        }
    }
    Y2Z00.stl
    {
        type triSurfaceMesh;
        Y2Z00{
            name Y2Z00;
        }
    }
    Y1Z10.stl
    {
        type triSurfaceMesh;
        Y1Z10{
            name Y1Z10;
        }
    }
    LBo21.stl
    {
        type triSurfaceMesh;
        LBo21{
            name LBo21;
        }
    }
    Y1Z04.stl
    {
        type triSurfaceMesh;
        Y1Z04{
            name Y1Z04;
        }
    }
    Y1Z06.stl
    {
        type triSurfaceMesh;
        Y1Z06{
            name Y1Z06;
        }
    }
    Y1Z07.stl
    {
        type triSurfaceMesh;
        Y1Z07{
            name Y1Z07;
        }
    }
    Y0Z05.stl
    {
        type triSurfaceMesh;
        Y0Z05{
            name Y0Z05;
        }
    }
    Y1Z12.stl
    {
        type triSurfaceMesh;
        Y1Z12{
            name Y1Z12;
        }
    }
    Y2Z04.stl
    {
        type triSurfaceMesh;
        Y2Z04{
            name Y2Z04;
        }
    }
    wNE.stl
    {
        type triSurfaceMesh;
        wNE{
            name wNE;
        }
    }
    Y0Z04.stl
    {
        type triSurfaceMesh;
        Y0Z04{
            name Y0Z04;
        }
    }
    LBo22.stl
    {
        type triSurfaceMesh;
        LBo22{
            name LBo22;
        }
    }
    Y0Z00.stl
    {
        type triSurfaceMesh;
        Y0Z00{
            name Y0Z00;
        }
    }
    LBu10.stl
    {
        type triSurfaceMesh;
        LBu10{
            name LBu10;
        }
    }
    a0.stl
    {
        type triSurfaceMesh;
        a0{
            name a0;
        }
    }
    Y1Z15.stl
    {
        type triSurfaceMesh;
        Y1Z15{
            name Y1Z15;
        }
    }
    Y0Z14.stl
    {
        type triSurfaceMesh;
        Y0Z14{
            name Y0Z14;
        }
    }
    Y0Z01.stl
    {
        type triSurfaceMesh;
        Y0Z01{
            name Y0Z01;
        }
    }
    Y2Z02.stl
    {
        type triSurfaceMesh;
        Y2Z02{
            name Y2Z02;
        }
    }
    Y2Z03.stl
    {
        type triSurfaceMesh;
        Y2Z03{
            name Y2Z03;
        }
    }
    Y1Z05.stl
    {
        type triSurfaceMesh;
        Y1Z05{
            name Y1Z05;
        }
    }
    Y0Z10.stl
    {
        type triSurfaceMesh;
        Y0Z10{
            name Y0Z10;
        }
    }
    LBu11.stl
    {
        type triSurfaceMesh;
        LBu11{
            name LBu11;
        }
    }
    Y0Z12.stl
    {
        type triSurfaceMesh;
        Y0Z12{
            name Y0Z12;
        }
    }
    Y0Z03.stl
    {
        type triSurfaceMesh;
        Y0Z03{
            name Y0Z03;
        }
    }
    LBo20.stl
    {
        type triSurfaceMesh;
        LBo20{
            name LBo20;
        }
    }
    Y1Z09.stl
    {
        type triSurfaceMesh;
        Y1Z09{
            name Y1Z09;
        }
    }
    Y1Z13.stl
    {
        type triSurfaceMesh;
        Y1Z13{
            name Y1Z13;
        }
    }
    Y1Z11.stl
    {
        type triSurfaceMesh;
        Y1Z11{
            name Y1Z11;
        }
    }
    Y1Z03.stl
    {
        type triSurfaceMesh;
        Y1Z03{
            name Y1Z03;
        }
    }
    Y2Z01.stl
    {
        type triSurfaceMesh;
        Y2Z01{
            name Y2Z01;
        }
    }
    Y2Z06.stl
    {
        type triSurfaceMesh;
        Y2Z06{
            name Y2Z06;
        }
    }
    Y1Z08.stl
    {
        type triSurfaceMesh;
        Y1Z08{
            name Y1Z08;
        }
    }
    Y0Z11.stl
    {
        type triSurfaceMesh;
        Y0Z11{
            name Y0Z11;
        }
    }
    LBu12.stl
    {
        type triSurfaceMesh;
        LBu12{
            name LBu12;
        }
    }
    Y0Z02.stl
    {
        type triSurfaceMesh;
        Y0Z02{
            name Y0Z02;
        }
    }
    LBo11.stl
    {
        type triSurfaceMesh;
        LBo11{
            name LBo11;
        }
    }
    Y1Z01.stl
    {
        type triSurfaceMesh;
        Y1Z01{
            name Y1Z01;
        }
    }
    Y1Z00.stl
    {
        type triSurfaceMesh;
        Y1Z00{
            name Y1Z00;
        }
    }
    Y1Z02.stl
    {
        type triSurfaceMesh;
        Y1Z02{
            name Y1Z02;
        }
    }
    Y2Z07.stl
    {
        type triSurfaceMesh;
        Y2Z07{
            name Y2Z07;
        }
    }
    LBo12.stl
    {
        type triSurfaceMesh;
        LBo12{
            name LBo12;
        }
    }
    a1.stl
    {
        type triSurfaceMesh;
        a1{
            name a1;
        }
    }
    Y0Z06.stl
    {
        type triSurfaceMesh;
        Y0Z06{
            name Y0Z06;
        }
    }
    Y0Z08.stl
    {
        type triSurfaceMesh;
        Y0Z08{
            name Y0Z08;
        }
    }
    Y1Z14.stl
    {
        type triSurfaceMesh;
        Y1Z14{
            name Y1Z14;
        }
    }
    Y2Z05.stl
    {
        type triSurfaceMesh;
        Y2Z05{
            name Y2Z05;
        }
    }
}

castellatedMeshControls
{

    maxLocalCells 10000000;
    maxGlobalCells 150000000;
    minRefinementCells 10;
    nCellsBetweenLevels 1;

    features
    (
        {
            file "wall.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "LBo10.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "symPlane.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y0Z09.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y0Z07.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y0Z13.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y0Z15.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y2Z00.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y1Z10.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "LBo21.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y1Z04.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y1Z06.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y1Z07.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y0Z05.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y1Z12.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y2Z04.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "wNE.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y0Z04.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "LBo22.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y0Z00.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "LBu10.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "a0.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y1Z15.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y0Z14.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y0Z01.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y2Z02.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y2Z03.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y1Z05.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y0Z10.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "LBu11.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y0Z12.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y0Z03.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "LBo20.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y1Z09.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y1Z13.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y1Z11.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y1Z03.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y2Z01.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y2Z06.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y1Z08.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y0Z11.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "LBu12.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y0Z02.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "LBo11.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y1Z01.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y1Z00.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y1Z02.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y2Z07.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "LBo12.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "a1.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y0Z06.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y0Z08.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y1Z14.extendedFeatureEdgeMesh";
            level 2;
        }
        {
            file "Y2Z05.extendedFeatureEdgeMesh";
            level 2;
        }
    );

    refinementSurfaces
    {
        wall.stl
        {
            level (2 3);
        }
        LBo10.stl
        {
            level (2 3);
            faceZone LBo10;
        }
        symPlane.stl
        {
            level (2 3);
        }
        Y0Z09.stl
        {
            level (2 3);
            faceZone Y0Z09;
        }
        Y0Z07.stl
        {
            level (2 3);
            faceZone Y0Z07;
        }
        Y0Z13.stl
        {
            level (2 3);
            faceZone Y0Z13;
        }
        Y0Z15.stl
        {
            level (2 3);
            faceZone Y0Z15;
        }
        Y2Z00.stl
        {
            level (2 3);
            faceZone Y2Z00;
        }
        Y1Z10.stl
        {
            level (2 3);
            faceZone Y1Z10;
        }
        LBo21.stl
        {
            level (2 3);
            faceZone LBo21;
        }
        Y1Z04.stl
        {
            level (2 3);
            faceZone Y1Z04;
        }
        Y1Z06.stl
        {
            level (2 3);
            faceZone Y1Z06;
        }
        Y1Z07.stl
        {
            level (2 3);
            faceZone Y1Z07;
        }
        Y0Z05.stl
        {
            level (2 3);
            faceZone Y0Z05;
        }
        Y1Z12.stl
        {
            level (2 3);
            faceZone Y1Z12;
        }
        Y2Z04.stl
        {
            level (2 3);
            faceZone Y2Z04;
        }
        wNE.stl
        {
            level (2 3);
            faceZone wNE;
        }
        Y0Z04.stl
        {
            level (2 3);
            faceZone Y0Z04;
        }
        LBo22.stl
        {
            level (2 3);
            faceZone LBo22;
        }
        Y0Z00.stl
        {
            level (2 3);
            faceZone Y0Z00;
        }
        LBu10.stl
        {
            level (2 3);
            faceZone LBu10;
        }
        a0.stl
        {
            level (2 3);
        }
        Y1Z15.stl
        {
            level (2 3);
            faceZone Y1Z15;
        }
        Y0Z14.stl
        {
            level (2 3);
            faceZone Y0Z14;
        }
        Y0Z01.stl
        {
            level (2 3);
            faceZone Y0Z01;
        }
        Y2Z02.stl
        {
            level (2 3);
            faceZone Y2Z02;
        }
        Y2Z03.stl
        {
            level (2 3);
            faceZone Y2Z03;
        }
        Y1Z05.stl
        {
            level (2 3);
            faceZone Y1Z05;
        }
        Y0Z10.stl
        {
            level (2 3);
            faceZone Y0Z10;
        }
        LBu11.stl
        {
            level (2 3);
            faceZone LBu11;
        }
        Y0Z12.stl
        {
            level (2 3);
            faceZone Y0Z12;
        }
        Y0Z03.stl
        {
            level (2 3);
            faceZone Y0Z03;
        }
        LBo20.stl
        {
            level (2 3);
            faceZone LBo20;
        }
        Y1Z09.stl
        {
            level (2 3);
            faceZone Y1Z09;
        }
        Y1Z13.stl
        {
            level (2 3);
            faceZone Y1Z13;
        }
        Y1Z11.stl
        {
            level (2 3);
            faceZone Y1Z11;
        }
        Y1Z03.stl
        {
            level (2 3);
            faceZone Y1Z03;
        }
        Y2Z01.stl
        {
            level (2 3);
            faceZone Y2Z01;
        }
        Y2Z06.stl
        {
            level (2 3);
            faceZone Y2Z06;
        }
        Y1Z08.stl
        {
            level (2 3);
            faceZone Y1Z08;
        }
        Y0Z11.stl
        {
            level (2 3);
            faceZone Y0Z11;
        }
        LBu12.stl
        {
            level (2 3);
            faceZone LBu12;
        }
        Y0Z02.stl
        {
            level (2 3);
            faceZone Y0Z02;
        }
        LBo11.stl
        {
            level (2 3);
            faceZone LBo11;
        }
        Y1Z01.stl
        {
            level (2 3);
            faceZone Y1Z01;
        }
        Y1Z00.stl
        {
            level (2 3);
            faceZone Y1Z00;
        }
        Y1Z02.stl
        {
            level (2 3);
            faceZone Y1Z02;
        }
        Y2Z07.stl
        {
            level (2 3);
            faceZone Y2Z07;
        }
        LBo12.stl
        {
            level (2 3);
            faceZone LBo12;
        }
        a1.stl
        {
            level (2 3);
        }
        Y0Z06.stl
        {
            level (2 3);
            faceZone Y0Z06;
        }
        Y0Z08.stl
        {
            level (2 3);
            faceZone Y0Z08;
        }
        Y1Z14.stl
        {
            level (2 3);
            faceZone Y1Z14;
        }
        Y2Z05.stl
        {
            level (2 3);
            faceZone Y2Z05;
        }
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
    }


    locationInMesh (8 0 2);

    allowFreeStandingZoneFaces true;
}



// Settings for the snapping.
snapControls
{
    //- Number of patch smoothing iterations before finding correspondence
    //  to surface
    nSmoothPatch 1;

    //- Relative distance for points to be attracted by surface feature point
    //  or edge. True distance is this factor times local
    //  maximum edge length.
    tolerance 1;

    //- Number of mesh displacement relaxation iterations.
    nSolveIter 300;

    //- Maximum number of snapping relaxation iterations. Should stop
    //  before upon reaching a correct mesh.
    nRelaxIter 5;

    // Feature snapping

        //- Number of feature edge snapping iterations.
        //  Leave out altogether to disable.
        nFeatureSnapIter 10;

        //- Detect (geometric) features by sampling the surface
        implicitFeatureSnap false;

        //- Use castellatedMeshControls::features
        explicitFeatureSnap true;

        //- Detect features between multiple surfaces
        //  (only for explicitFeatureSnap, default = false)
        multiRegionFeatureSnap true;
}



// Settings for the layer addition.
addLayersControls
{
    // Are the thickness parameters below relative to the undistorted
    // size of the refined cell outside layer (true) or absolute sizes (false).
    relativeSizes true;

    // Per final patch (so not geometry!) the layer information
    layers
    {
        "allBoundary.*"
        {
            nSurfaceLayers 1;
        }
    }

    // Expansion factor for layer mesh
    expansionRatio 1.0;


    // Wanted thickness of final added cell layer. If multiple layers
    // is the thickness of the layer furthest away from the wall.
    // Relative to undistorted size of cell outside layer.
    // See relativeSizes parameter.
    finalLayerThickness 0.3;

    // Minimum thickness of cell layer. If for any reason layer
    // cannot be above minThickness do not add layer.
    // See relativeSizes parameter.
    minThickness 0.25;

    // If points get not extruded do nGrow layers of connected faces that are
    // also not grown. This helps convergence of the layer addition process
    // close to features.
    nGrow 0;


    // Advanced settings

    // When not to extrude surface. 0 is flat surface, 90 is when two faces
    // are perpendicular
    featureAngle 30;

    // Maximum number of snapping relaxation iterations. Should stop
    // before upon reaching a correct mesh.
    nRelaxIter 5;

    // Number of smoothing iterations of surface normals
    nSmoothSurfaceNormals 1;

    // Number of smoothing iterations of interior mesh movement direction
    nSmoothNormals 3;

    // Smooth layer thickness over surface patches
    nSmoothThickness 10;

    // Stop layer growth on highly warped cells
    maxFaceThicknessRatio 0.5;

    // Reduce layer growth where ratio thickness to medial
    // distance is large
    maxThicknessToMedialRatio 0.3;

    // Angle used to pick up medial axis points
    minMedianAxisAngle 90;

    // Create buffer region for new layer terminations
    nBufferCellsNoExtrude 0;


    // Overall max number of layer addition iterations. The mesher will exit
    // if it reaches this number of iterations; possibly with an illegal
    // mesh.
    nLayerIter 50;

    // Max number of iterations after which relaxed meshQuality controls
    // get used. Up to nRelaxIter it uses the settings in meshQualityControls,
    // after nRelaxIter it uses the values in meshQualityControls::relaxed.
    nRelaxedIter 20;
}



// Generic mesh quality settings. At any undoable phase these determine
// where to undo.
meshQualityControls
{
    #include "meshQualityDict"

    // Optional : some meshing phases allow usage of relaxed rules.
    // See e.g. addLayersControls::nRelaxedIter.
    relaxed
    {
        //- Maximum non-orthogonality allowed. Set to 180 to disable.
        maxNonOrtho 75;
    }

    // Advanced

    //- Number of error distribution iterations
    nSmoothScale 4;
    //- amount to scale back displacement at error points
    errorReduction 0.75;
    
    maxConcave 90;
    
    
    maxBoundarySkewness 3;
    maxInternalSkewness 2;
}


// Advanced

// Write flags
writeFlags
(
    scalarLevels    // write volScalarField with cellLevel for postprocessing
    layerSets       // write cellSets, faceSets of faces in layer
    layerFields     // write volScalarField for layer coverage
);


// Merge tolerance. Is fraction of overall bounding box of initial mesh.
// Note: the write tolerance needs to be higher than this.
mergeTolerance 1E-6;


// ************************************************************************* //
