third_party/cfd_suite/Docker/ESP/baseCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2922;
        startFace       41892;
    }
    symPlane
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          647;
        startFace       44814;
    }
    a0
    {
        type            patch;
        nFaces          36;
        startFace       45461;
    }
    a1
    {
        type            patch;
        nFaces          372;
        startFace       45497;
    }
)

// ************************************************************************* //
