third_party/cfd_suite/Docker/ESP/baseCase/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver                GAMG;
        smoother              GaussSeidel;
        cacheAgglomeration    true;
        nCellsInCoarsestLevel 100;
        agglomerator          faceAreaPair;
        mergeLevels           1;
        tolerance             1e-06;
        relTol                0.01;
    }

    "(U|k|epsilon|omega|R|nuTilda)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;

    residualControl
    {
        p                   5e-4;
        U                   7e-7;
        "(k|epsilon|omega)" 1.2e-1;
    }
}

relaxationFactors
{
    fields
    {
        p              0.2;
    }
    equations
    {
        U              0.4;
        k              0.4;
        epsilon        0.4;
        omega          0.4;
        R              0.4;
        nuTilda        0.4;
    }
}


// ************************************************************************* //
